src/cf/InformationRegisters/КотировкиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КотировкиЦБ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКотировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКотировокЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыКотировокЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКотировокЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦенаЗакрытия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/РаботаСКотировкамиЦБ/Ext/Module.bsl
// Общий модуль РаботаСКотировкамиЦБ
// Бизнес-логика загрузки котировок ценных бумаг с MOEX ISS API.
//
// Сервер, ВнешнееСоединение.

#Область ПрограммныйИнтерфейс

// Загружает котировки с MOEX ISS API за указанный период по списку ценных бумаг.
// Записывает результат в РегистрСведений.КотировкиЦБ.
//
// Параметры:
//   ПараметрыЗагрузки - Структура:
//     * НачалоПериода   - Дата - начало периода загрузки (обязательно)
//     * ОкончаниеПериода - Дата - окончание периода загрузки (обязательно)
//     * СписокЦБ        - Массив из Структура - список ЦБ для загрузки:
//         ** ЦеннаяБумага  - СправочникСсылка.ЦенныеБумаги
//         ** Тикер         - Строка - SECID для MOEX API
//         ** ТипБумагиКод  - Строка - код типа бумаги для маппинга рынка
//     * БазовыйURL       - Строка - базовый URL MOEX ISS API
//     * BOARDIDАкций     - Строка - BOARDID для акций (по умолчанию "TQBR")
//     * BOARDIDОблигаций - Строка - BOARDID для облигаций (по умолчанию "TQCB")
//
// Возвращаемое значение:
//   Структура:
//     * ЗагруженоКотировок - Число
//     * ОбработаноБумаг    - Число
//     * БумагиБезДанных    - Число
//     * Ошибки             - Массив из Структура (Тикер, ТекстОшибки)
//
Функция ЗагрузитьКотировкиСМОЕХ(ПараметрыЗагрузки) Экспорт

	// Валидация периода
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.НачалоПериода)
		Или Не ЗначениеЗаполнено(ПараметрыЗагрузки.ОкончаниеПериода) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан период загрузки котировок.'");
	КонецЕсли;

	БазовыйURL = ПараметрыЗагрузки.БазовыйURL;
	BOARDIDАкций = ПараметрыЗагрузки.BOARDIDАкций;
	BOARDIDОблигаций = ПараметрыЗагрузки.BOARDIDОблигаций;

	Результат = Новый Структура;
	Результат.Вставить("ЗагруженоКотировок", 0);
	Результат.Вставить("ОбработаноБумаг", 0);
	Результат.Вставить("БумагиБезДанных", 0);
	Результат.Вставить("Ошибки", Новый Массив);

	ВидКотировки = Перечисления.ВидыКотировокЦБ.ЦенаЗакрытия;

	Для Каждого ЭлементСписка Из ПараметрыЗагрузки.СписокЦБ Цикл
		ОбработатьОднуБумагу(ЭлементСписка, ПараметрыЗагрузки, БазовыйURL,
			BOARDIDАкций, BOARDIDОблигаций, ВидКотировки, Результат);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает идентификатор рынка MOEX по коду типа бумаги.
//
// Параметры:
//   ТипБумагиКод - Строка - код типа бумаги из справочника ЦенныеБумаги
//
// Возвращаемое значение:
//   Строка - "shares", "bonds" или "" (пустая строка для неизвестного типа)
//
Функция ПолучитьРынокПоТипуБумаги(ТипБумагиКод) Экспорт

	МаппингРынков = Новый Соответствие;

	// Акции и подобные
	МаппингРынков.Вставить("common_share", "shares");
	МаппингРынков.Вставить("preferred_share", "shares");
	МаппингРынков.Вставить("depositary_receipt", "shares");
	МаппингРынков.Вставить("etf_ppif", "shares");
	МаппингРынков.Вставить("public_ppif", "shares");
	МаппингРынков.Вставить("interval_ppif", "shares");

	// Облигации
	МаппингРынков.Вставить("corporate_bond", "bonds");
	МаппингРынков.Вставить("exchange_bond", "bonds");
	МаппингРынков.Вставить("ofz_bond", "bonds");
	МаппингРынков.Вставить("cb_bond", "bonds");
	МаппингРынков.Вставить("municipal_bond", "bonds");
	МаппингРынков.Вставить("subfederal_bond", "bonds");
	МаппингРынков.Вставить("euro_bond", "bonds");
	МаппингРынков.Вставить("ifi_bond", "bonds");
	МаппингРынков.Вставить("sovereign_bond", "bonds");

	Рынок = МаппингРынков.Получить(ТипБумагиКод);
	Если Рынок = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат Рынок;

КонецФункции

// Формирует полный URL для запроса к MOEX ISS API.
//
// Параметры:
//   БазовыйURL - Строка - базовый URL (например "https://iss.moex.com/iss")
//   Рынок      - Строка - "shares" или "bonds"
//   Тикер      - Строка - SECID ценной бумаги
//   ДатаС      - Дата   - начало периода
//   ДатаПо     - Дата   - окончание периода
//   Смещение   - Число  - смещение для пагинации (параметр start), по умолчанию 0
//
// Возвращаемое значение:
//   Строка - полный URL запроса
//
Функция СформироватьURLЗапроса(БазовыйURL, Рынок, Тикер, ДатаС, ДатаПо, Смещение = 0) Экспорт

	ДатаСФормат = Формат(ДатаС, "ДФ=yyyy-MM-dd");
	ДатаПоФормат = Формат(ДатаПо, "ДФ=yyyy-MM-dd");

	Адрес = СтрШаблон(
		"%1/history/engines/stock/markets/%2/securities/%3.json?from=%4&till=%5",
		БазовыйURL, Рынок, Тикер, ДатаСФормат, ДатаПоФормат);

	Если Смещение > 0 Тогда
		Адрес = Адрес + "&start=" + Формат(Смещение, "ЧГ=");
	КонецЕсли;

	Возврат Адрес;

КонецФункции

// Разбирает JSON-ответ MOEX ISS API. Извлекает массив записей из history.data,
// колонки из history.columns, и данные пагинации из history.cursor.
//
// Параметры:
//   ТелоОтвета - Строка - JSON-строка ответа MOEX ISS API
//
// Возвращаемое значение:
//   Структура:
//     * Записи   - Массив из Структура
//     * Курсор   - Структура (INDEX, TOTAL, PAGESIZE)
//     * Колонки  - Массив из Строка
//
Функция РазобратьОтветМОЕХ(ТелоОтвета) Экспорт

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
	ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON, Истина);
	ЧтениеJSON.Закрыть();

	Результат = Новый Структура;

	// Колонки
	БлокИстории = ДанныеОтвета["history"];
	Колонки = БлокИстории["columns"];
	Результат.Вставить("Колонки", Колонки);

	// Записи: преобразуем массив массивов в массив структур
	ДанныеИстории = БлокИстории["data"];
	МассивЗаписей = Новый Массив;

	Для Каждого СтрокаДанных Из ДанныеИстории Цикл
		Запись = Новый Структура;
		Для Индекс = 0 По Колонки.ВГраница() Цикл
			Запись.Вставить(Колонки[Индекс], СтрокаДанных[Индекс]);
		КонецЦикла;
		МассивЗаписей.Добавить(Запись);
	КонецЦикла;
	Результат.Вставить("Записи", МассивЗаписей);

	// Курсор
	БлокКурсора = ДанныеОтвета["history.cursor"];
	КолонкиКурсора = БлокКурсора["columns"];
	ДанныеКурсора = БлокКурсора["data"][0];

	Курсор = Новый Структура;
	Для Индекс = 0 По КолонкиКурсора.ВГраница() Цикл
		Курсор.Вставить(КолонкиКурсора[Индекс], ДанныеКурсора[Индекс]);
	КонецЦикла;
	Результат.Вставить("Курсор", Курсор);

	Возврат Результат;

КонецФункции

// Фильтрует записи MOEX по BOARDID. Возвращает соответствие: TRADEDATE -> значение котировки.
// Для каждой даты берет запись с указанным BOARDID; если нет -- первую с ненулевой ценой (fallback).
// Цена: CLOSE; если CLOSE = null -- LEGALCLOSEPRICE.
//
// Параметры:
//   Записи          - Массив из Структура - записи из РазобратьОтветМОЕХ
//   BOARDID         - Строка - приоритетный BOARDID ("TQBR" или "TQCB")
//   BOARDIDFallback - Булево - разрешить fallback на другой BOARDID (по умолчанию Истина)
//
// Возвращаемое значение:
//   Соответствие (Дата -> Число)
//
Функция ОтфильтроватьПоBOARDID(Записи, BOARDID, BOARDIDFallback = Истина) Экспорт

	// Группируем записи по дате
	ЗаписиПоДатам = Новый Соответствие;
	Для Каждого Запись Из Записи Цикл
		ДатаТоргов = Запись.TRADEDATE;
		СписокЗаписей = ЗаписиПоДатам.Получить(ДатаТоргов);
		Если СписокЗаписей = Неопределено Тогда
			СписокЗаписей = Новый Массив;
			ЗаписиПоДатам.Вставить(ДатаТоргов, СписокЗаписей);
		КонецЕсли;
		СписокЗаписей.Добавить(Запись);
	КонецЦикла;

	Котировки = Новый Соответствие;

	Для Каждого КлючЗначение Из ЗаписиПоДатам Цикл
		ДатаСтрока = КлючЗначение.Ключ;
		СписокЗаписей = КлючЗначение.Значение;

		Цена = ПолучитьЦенуЗаДату(СписокЗаписей, BOARDID, BOARDIDFallback);

		Если Цена <> Неопределено Тогда
			ДатаЗначение = ПреобразоватьДатуМОЕХ(ДатаСтрока);
			Котировки.Вставить(ДатаЗначение, Цена);
		КонецЕсли;

	КонецЦикла;

	Возврат Котировки;

КонецФункции

// Записывает котировки в РегистрСведений.КотировкиЦБ.
// При повторной записи перезаписывает существующие данные.
//
// Параметры:
//   ЦеннаяБумага - СправочникСсылка.ЦенныеБумаги
//   Котировки    - Соответствие (Дата -> Число)
//   ВидКотировки - ПеречислениеСсылка.ВидыКотировокЦБ
//
Процедура ЗаписатьКотировкиВРегистр(ЦеннаяБумага, Котировки, ВидКотировки) Экспорт

	Для Каждого КлючЗначение Из Котировки Цикл

		Период = КлючЗначение.Ключ;
		Значение = КлючЗначение.Значение;

		НаборЗаписей = РегистрыСведений.КотировкиЦБ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Отбор.ЦеннаяБумага.Установить(ЦеннаяБумага);
		НаборЗаписей.Отбор.ВидКотировки.Установить(ВидКотировки);

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Период;
		НоваяЗапись.ЦеннаяБумага = ЦеннаяБумага;
		НоваяЗапись.ВидКотировки = ВидКотировки;
		НоваяЗапись.Значение = Значение;

		НаборЗаписей.Записать(Истина);

	КонецЦикла;

КонецПроцедуры

// Выполняет HTTP GET запрос и возвращает тело ответа.
// Выделен в отдельную функцию для возможности мокирования в тестах.
//
// Параметры:
//   URL - Строка - полный URL запроса
//
// Возвращаемое значение:
//   Структура:
//     * Успех           - Булево
//     * ТелоОтвета      - Строка
//     * КодСостояния    - Число
//     * ТекстОшибки     - Строка
//
Функция ВыполнитьHTTPЗапрос(URL) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ТелоОтвета", "");
	Результат.Вставить("КодСостояния", 0);
	Результат.Вставить("ТекстОшибки", "");

	Попытка
		// Разбираем URL
		СтруктураURL = РазобратьURL(URL);
		Хост = СтруктураURL.Хост;
		Путь = СтруктураURL.Путь;
		ЭтоHTTPS = СтруктураURL.ЭтоHTTPS;

		ТаймаутСоединения = 30;
		Если ЭтоHTTPS Тогда
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
			Соединение = Новый HTTPСоединение(Хост, 443, , , , ТаймаутСоединения, ЗащищенноеСоединение);
		Иначе
			Соединение = Новый HTTPСоединение(Хост, 80, , , , ТаймаутСоединения);
		КонецЕсли;

		Запрос = Новый HTTPЗапрос(Путь);
		Ответ = Соединение.Получить(Запрос);

		Результат.КодСостояния = Ответ.КодСостояния;
		Результат.ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");

		Если Ответ.КодСостояния = 200 Тогда
			Результат.Успех = Истина;
		Иначе
			Результат.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'HTTP ошибка %1'"),
				Ответ.КодСостояния);
		КонецЕсли;

	Исключение
		Результат.ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Котировки.ЗагрузкаСМОЕХ.HTTPЗапрос'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обрабатывает загрузку котировок для одной ценной бумаги.
// Вынесено из ЗагрузитьКотировкиСМОЕХ для снижения когнитивной сложности.
//
Процедура ОбработатьОднуБумагу(ЭлементСписка, ПараметрыЗагрузки, БазовыйURL,
	БордАкций, БордОблигаций, ВидКотировки, Результат)

	Тикер = ЭлементСписка.Тикер;
	ТипБумагиКод = ЭлементСписка.ТипБумагиКод;
	ЦеннаяБумага = ЭлементСписка.ЦеннаяБумага;

	Попытка
		ВсеКотировки = ЗагрузитьКотировкиСФоллбэком(
			БазовыйURL, ТипБумагиКод, Тикер,
			ПараметрыЗагрузки.НачалоПериода, ПараметрыЗагрузки.ОкончаниеПериода,
			БордАкций, БордОблигаций);

		Если ВсеКотировки.Количество() > 0 Тогда
			ЗаписатьКотировкиВРегистр(ЦеннаяБумага, ВсеКотировки, ВидКотировки);
			Результат.ОбработаноБумаг = Результат.ОбработаноБумаг + 1;
			Результат.ЗагруженоКотировок = Результат.ЗагруженоКотировок + ВсеКотировки.Количество();
		Иначе
			Результат.БумагиБезДанных = Результат.БумагиБезДанных + 1;
		КонецЕсли;

	Исключение
		ОписаниеОшибки = Новый Структура;
		ОписаниеОшибки.Вставить("Тикер", Тикер);
		ОписаниеОшибки.Вставить("ТекстОшибки", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат.Ошибки.Добавить(ОписаниеОшибки);

		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Котировки.ЗагрузкаСМОЕХ'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Загружает котировки с попыткой нескольких рынков для неизвестного типа.
//
// Возвращаемое значение:
//   Соответствие (Дата -> Число)
//
Функция ЗагрузитьКотировкиСФоллбэком(БазовыйURL, ТипБумагиКод, Тикер,
	НачалоПериода, ОкончаниеПериода, БордАкций, БордОблигаций)

	Рынок = ПолучитьРынокПоТипуБумаги(ТипБумагиКод);

	РынкиДляПопытки = Новый Массив;
	Если Рынок = "" Тогда
		РынкиДляПопытки.Добавить("shares");
		РынкиДляПопытки.Добавить("bonds");
	Иначе
		РынкиДляПопытки.Добавить(Рынок);
	КонецЕсли;

	Для Каждого ТекущийРынок Из РынкиДляПопытки Цикл
		ТекБорд = ?(ТекущийРынок = "shares", БордАкций, БордОблигаций);
		КотировкиРынка = ЗагрузитьКотировкиПоРынку(
			БазовыйURL, ТекущийРынок, Тикер,
			НачалоПериода, ОкончаниеПериода, ТекБорд);

		Если КотировкиРынка.Количество() > 0 Тогда
			Возврат КотировкиРынка;
		КонецЕсли;
	КонецЦикла;

	Возврат Новый Соответствие;

КонецФункции

// Загружает котировки по конкретному рынку с обработкой пагинации.
//
// Параметры:
//   БазовыйURL       - Строка
//   Рынок            - Строка - "shares" или "bonds"
//   Тикер            - Строка
//   НачалоПериода    - Дата
//   ОкончаниеПериода - Дата
//   BOARDID          - Строка
//
// Возвращаемое значение:
//   Соответствие (Дата -> Число)
//
Функция ЗагрузитьКотировкиПоРынку(БазовыйURL, Рынок, Тикер, НачалоПериода, ОкончаниеПериода, BOARDID)

	Котировки = Новый Соответствие;
	Смещение = 0;

	Пока Истина Цикл

		URL = СформироватьURLЗапроса(БазовыйURL, Рынок, Тикер, НачалоПериода, ОкончаниеПериода, Смещение);
		РезультатHTTP = ВыполнитьHTTPЗапрос(URL);

		Если Не РезультатHTTP.Успех Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Ошибка HTTP-запроса для тикера %1: %2'"),
				Тикер, РезультатHTTP.ТекстОшибки);
		КонецЕсли;

		ДанныеОтвета = РазобратьОтветМОЕХ(РезультатHTTP.ТелоОтвета);

		Если ДанныеОтвета.Записи.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;

		КотировкиСтраницы = ОтфильтроватьПоBOARDID(ДанныеОтвета.Записи, BOARDID);
		Для Каждого КлючЗначение Из КотировкиСтраницы Цикл
			Котировки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;

		// Проверка пагинации
		Если ДанныеОтвета.Курсор.INDEX + ДанныеОтвета.Курсор.PAGESIZE >= ДанныеОтвета.Курсор.TOTAL Тогда
			Прервать;
		КонецЕсли;

		Смещение = ДанныеОтвета.Курсор.INDEX + ДанныеОтвета.Курсор.PAGESIZE;

	КонецЦикла;

	Возврат Котировки;

КонецФункции

// Определяет цену для одной даты из списка записей по правилам BOARDID-фильтрации.
//
// Параметры:
//   СписокЗаписей   - Массив из Структура - записи за одну дату
//   ПриоритетныйБорд - Строка - приоритетный BOARDID
//   РазрешенФоллбэк  - Булево - разрешен ли откат на другой BOARDID
//
// Возвращаемое значение:
//   Число или Неопределено
//
Функция ПолучитьЦенуЗаДату(СписокЗаписей, ПриоритетныйБорд, РазрешенФоллбэк)

	// Ищем запись с указанным BOARDID
	ЗаписьОсновная = Неопределено;
	Для Каждого ТекЗапись Из СписокЗаписей Цикл
		Если ТекЗапись.BOARDID = ПриоритетныйБорд Тогда
			ЗаписьОсновная = ТекЗапись;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Цена = Неопределено;

	Если ЗаписьОсновная <> Неопределено Тогда
		Цена = ПолучитьЦенуИзЗаписи(ЗаписьОсновная);
	КонецЕсли;

	// Откат: если основной записи нет или цена не определена
	Если Цена = Неопределено И РазрешенФоллбэк Тогда
		Для Каждого ТекЗапись Из СписокЗаписей Цикл
			ЦенаКандидат = ПолучитьЦенуИзЗаписи(ТекЗапись);
			Если ЦенаКандидат <> Неопределено Тогда
				Возврат ЦенаКандидат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Цена;

КонецФункции

// Извлекает цену из записи MOEX. Приоритет: CLOSE, затем LEGALCLOSEPRICE.
//
// Параметры:
//   Запись - Структура - запись торгов из ответа MOEX
//
// Возвращаемое значение:
//   Число или Неопределено
//
Функция ПолучитьЦенуИзЗаписи(Запись)

	Если Запись.Свойство("CLOSE") И Запись.CLOSE <> Неопределено И Запись.CLOSE <> Null Тогда
		Возврат Запись.CLOSE;
	КонецЕсли;

	Если Запись.Свойство("LEGALCLOSEPRICE") И Запись.LEGALCLOSEPRICE <> Неопределено И Запись.LEGALCLOSEPRICE <> Null Тогда
		Возврат Запись.LEGALCLOSEPRICE;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Преобразует строку даты MOEX (YYYY-MM-DD) в тип Дата.
//
// Параметры:
//   ДатаСтрока - Строка - дата в формате "YYYY-MM-DD"
//
// Возвращаемое значение:
//   Дата
//
Функция ПреобразоватьДатуМОЕХ(ДатаСтрока)

	Фрагменты = СтрРазделить(ДатаСтрока, "-");
	Год = Число(Фрагменты[0]);
	Месяц = Число(Фрагменты[1]);
	День = Число(Фрагменты[2]);

	Возврат Дата(Год, Месяц, День);

КонецФункции

// Разбирает URL на составные части.
//
// Параметры:
//   URL - Строка - полный URL
//
// Возвращаемое значение:
//   Структура (Хост, Путь, ЭтоHTTPS)
//
Функция РазобратьURL(URL)

	Результат = Новый Структура("Хост, Путь, ЭтоHTTPS");

	АдресБезПротокола = URL;
	Если СтрНачинаетсяС(НРег(URL), "https://") Тогда
		Результат.ЭтоHTTPS = Истина;
		АдресБезПротокола = Сред(URL, 9);
	ИначеЕсли СтрНачинаетсяС(НРег(URL), "http://") Тогда
		Результат.ЭтоHTTPS = Ложь;
		АдресБезПротокола = Сред(URL, 8);
	Иначе
		Результат.ЭтоHTTPS = Ложь;
	КонецЕсли;

	ПозицияСлеша = СтрНайти(АдресБезПротокола, "/");
	Если ПозицияСлеша > 0 Тогда
		Результат.Хост = Лев(АдресБезПротокола, ПозицияСлеша - 1);
		Результат.Путь = Сред(АдресБезПротокола, ПозицияСлеша);
	Иначе
		Результат.Хост = АдресБезПротокола;
		Результат.Путь = "/";
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти
